app/Controllers/Post.php

public function create()
{
$model = new ArtikelModel();
$data = [
'judul' => $this->request->getVar('judul'),
'isi' => $this->request->getVar('isi'),
];
$model->insert($data);
---
INSERT INTO `artikel` (`judul`, `isi`) VALUES ('Foto Bincang-bincang\" awalnya dari Istana', 'Jakarta (ANTARA) - Dulu, saat meliput acara ekonomi, seperti Rapat Umum Pemegang Saham (RUPS), atau pengenalan direksi baru, teman-teman pewarta foto sering bertanya, \"Siapa sih pencetus ide foto bincang-bincang?\"')